first_routes/app/controllers/artwork_shares_controller.rb

    def index
        @artwork_share = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def show
        @artwork_share = ArtworkShare.find(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        @artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]