first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        @artwork = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "title" = $2, "image_url" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["artist_id", 1], ["title", "r28yr328yr8y23ruh"], ["image_url", "wkgihui42uyhi5o2jo52"], ["updated_at", "2022-05-05 13:38:40.399376"], ["id", 4]]
---
    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)