first_routes/app/controllers/comments_controller.rb

    def index

        if params.has_key?(:artwork_id)
            @artwork = Artwork.find(params[:artwork_id])
            @comments = @artwork.comments
            render json: @comments
        else
            @user = User.find(params[:user_id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]