first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bob"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        if params.has_key?(:username)
           @user = User.find_by(username: params[:username])

            if @user.nil?
              render plain: "User does not exist"
            else
                render json: @user
            end

        else
            @users = User.all